define(function () {
    var courses = [
        {
            id: 1, course: 'Курс "C# програмиране - част I"',
            courseDescription: 'Новото издание на курса "C# програмиране - част 1" започва в края на октомври 2013г. Той е част от програмата "Софтуерна академия на Телерик" и може да се посещава само от участниците в нея. Всички останали желаещи да изучават програмиране със C# могат да се включат онлайн.',
            url: 'http://telerikacademy.com/Courses/Courses/Details/144'
        },
        {
            id: 2, course: 'Курс "C# програмиране - част II"',
            courseDescription: 'Безплатният курс "C# програмиране - част II" е продължение на навлизането в основите на програмирането. Изучават се малко по-сложни, но все пак базови, концепции от програмирането като използване на масиви за обработка на редици и матрици от елементи, алгоритми върху редици и матрици, работа с методи (дефиниране и извикване, използване на параметри), бройни системи и преминаване между тях, работа с обекти от стандартната библиотека на .NET (създаване на обекти и извикване на свойства и методи), обработка на грешки и работа с изключения, работа със стрингове и обработка на текст, алгоритми за парсване на текст и работа с текстови файлове. Курсът завършва с практически изпит по програмиране. ',
            url: 'http://telerikacademy.com/Courses/Courses/Details/151'
        },
        {
            id: 3, course: 'Курс "Обектно-ориентирано програмиране (ООП)"',
            courseDescription: 'Безплатният курс по "Обектно-ориентирано програмиране (ООП)" учи на принципите за работа с класове и обекти и парадигмите на обектно-ориентираното програмиране. Изучават се принципите на абстракция, капсулация на данни, наследяване, полиморфизъм и виртуални методи, моделиране на реалния свят с класове, използване на UML клас-диаграми, преизползване на програмен код и работа с интерфейси, абстрактни обекти и данни.',
            url: 'http://telerikacademy.com/Courses/Courses/Details/159'
        }
    ];

    return {
        courses: courses
    }
})